str_help = "Я был создан для того, чтобы ты лучше усваивал нужный материал,\n" \
           "максимально быстро и просто. Вот что для этого нужно делать:\n" \
           "загрузи файл со своими материалами в бот (работаю с расширениями .txt и .docx),\n" \
           " я с ним разберусь и подготовлю твой личный курс по этой теме!\n" \
           "Мои команды :\n" \
           "/create_course - создать новый курс\n" \
           "/lern_course - начать изучение нового курса\n" \
           "/author_registration - регистрация автора (необходимо рпи создании курса)\n"
str_customer_already_regitred="Вы являетесь уже зарегистрированным автором, мои поздравления!)\n"
str_customer_dint_regitred="Вы не являетесь зарегистрированным автором! Для добавления курса сначала пройдите регистрацию (это займёт 2 минуты)"
str_error_for_create_course="Что- то пошло не так, попробуйте создать курс заново."
str_error_for_registration="Что- то пошло не так, попробуйте зарегистрироваться заново."